importPackage(Packages.server);

var enter = "\r\n";
var seld = -1;

var need = 4021031, qty = 60;

var dskin = [2630214,2630178,2630222,2630137,2439925,2439769,2439686,2439684,2439665,2439617,2439572,2439408,2439395,2439393,2439381,2439338,2439337,2439336,2439298,2438871,2438885,2438713,2438672,2438492,2438485,2438419,2438417,2438415,2438353,2438147,2438146,2437877,2438312,2438311,2438310,2438309,2438308,2438307,2438306,2438305,2438304,2438303,2438302,2438301,2438300,2438299,2438298,2438296,2438294,2438293,2438291,2438290,2438289,2438288,2438287,2436596,2438286,2438285,2438284,2438283,2438282,2438281,2438280,2438277,2438276,2438274,2438273,2438271,2436182,2438270,2438269,2438268,2438267,2438266,2438265,2438264,2438263,2438262,2438260,2438259,2438258,2438257,2438256,2438254,2438253,2438252,2438251,2438250,2438249,2435524,2435523,2435521,2438248,2438247,2438246,2438244,2438243,2438240,2438239,2438238,2438237,2438236,2438235,2438234,2438229,2438227,2438226,2438225,2438224,2438223,2438222,2438221,2438220,2438219,2438218,2438217,2438216,2438215,2438214,2438213,2438212,2438211,2438210,2438209,2438208,2438200,2438199,2438198,2438197,2438196,2438195,2438194,2438192,2438190,2438189,2438188,2438185,2438184,2438183,2438181,2438171,2438166,2438164,2438161,2435172,2438207,2438206,2438205,2438204,2438203,2438202,2438201,2438193,2438191,2438167,2438174,2438170,2438163,2438187,2438186,2438182,2438180,2438179,2438178,2438177,2438176,2438175,2438173,2438172,2438169,2438168,2438165,2438162,2438160,2438159];
function start() {
	status = -1;
	action(1, 0, 0);
}
function action(mode, type, sel) {
	if (mode == 1) {
		status++;
	} else {
		cm.dispose();
		return;
    	}
	if (status == 0) {
		var msg = "#fs11#"+enter;
		msg += "#fc0xFF000000#사냥을 다채롭게 만들어 줄 각종 스킨이 준비되어있는 것 같다.#b"+enter;
		msg += "랜덤 - #i"+need+"##z"+need+"# "+qty+"개"+enter;
		//msg += "선택 - #i"+선택필요+"##z"+선택필요+"# "+선택개수+"개#b"+enter;
		msg += "#L1##fs11##d아이템 목록을 확인해본다."+enter;
		msg += "#L2#랜덤으로 뽑아볼래.\r\n";
		//msg += "#L3#선택 박스를 개봉할래요!";
		
		cm.sendSimple(msg);
	} else if (status == 1) {
		switch (sel) {
			case 1:
				var msg = "#fs11##b"+enter;
				for (i = 0; i < dskin.length; i++) msg += "#i"+dskin[i]+"##z"+dskin[i]+"#"+enter;
				cm.sendOk(msg);
				cm.dispose();
			break;
			case 2:
				if (!cm.haveItem(need, qty)) {
					cm.sendOk("#fs11#뽑기에 필요한 재료가 없다.");
					cm.dispose();
					return;
				}
				a = Randomizer.rand(0, (dskin.length - 1));
				cm.gainItem(need, -qty);
				cm.gainItem(dskin[a], 1);
				cm.sendOk("#fs11#다음과 같은 아이템이 나왔다. #fs11##b"+enter+"#i"+dskin[a]+"##z"+dskin[a]+"#");
				cm.dispose();
			break;
			case 3:
				var msg = "원하시는 라이딩을 선택해주세요. #fs11##b"+enter;
				for (i = 0; i < dskin.length; i++) msg += "#L"+i+"##i"+dskin[i]+"##z"+dskin[i]+"#"+enter;
				cm.sendSimple(msg);
			break;
		}
	} else if (status == 2) {
			if (!cm.haveItem(선택필요, 선택개수)) {
				cm.sendOk("필요한 아이템이 부족하네요.");
				cm.dispose();
				return;
			}
			a = sel;
			cm.gainItem(선택필요, -선택개수);
			cm.gainItem(dskin[a], 1);
			cm.sendOk("다음과 같은 아이템이 나왔습니다! #fs11##b"+enter+"#i"+dskin[a]+"##z"+dskin[a]+"#");
			cm.dispose();
	}
}