var coupon = 2432327, qty = 0;

function start()
{
	status = -1;
	action(1, 0, 0);
} 

function action(mode, type, selection)
{
	if (mode == -1) {
		cm.dispose();
		return;
	}
	if(mode != 1)
	{
		cm.dispose();
		return;
	}
	else
	{
		status++;
	}


   if (status == 0) {
      var msg = "\r\n#fc0xFF000000##fs11#다양한 해외의 헤어와 성형을 체험해봐!\r\n\r\n";
      msg += "#L1##b헤어를 바꾸고 싶습니다.#l\r\n";
      //msg += "#L2##b성형을 바꾸고 싶습니다.#l\r\n";
      //msg += "#L3##b염색,렌즈,피부를 변경하고 싶습니다.#l\r\n";
      //msg += "#L4##b성전환, 검색캐시를 이용하고 싶습니다.";
      cm.sendSimple(msg);
   } else if (status ==1) {
      codyList = [];
      gColor = !cm.getPlayer().getGender() ? "#fs11##d여성" : "#fs11##b남성";
      seld = selection;
      selStr = "#fs11##fc0xFF000000#원하는 리스트를 골라봐";
      switch (seld) {
         case 1:
            selStr += "\r\n\r\n#e#r[캐릭터 헤어 변경하기]#b#n\r\n";
            selStr += "#L1##fs11##e해외 헤어#n 리스트 A#l#L2# #e해외 헤어#n 리스트 B#l\r\n";
		if (cm.getPlayer().getAndroid() != null) {
            		
            //selStr += "\r\n\r\n#e#r#fs12#[안드로이드 헤어 변경하기]#k#b#n\r\n";
            //selStr += "#L12##fs11##e해외 헤어#n 리스트 A#l#L13# #e해외 헤어#n 헤어 리스트 B#l\r\n";
            //selStr += "#L14##e해외 헤어# 리스트 C#l#L15# #e해외 헤어#n 헤어 리스트 D#l\r\n";
            		
		}
         break;
         case 2:
            selStr += "\r\n\r\n#e#r[캐릭터 성형]#b#n\r\n";
            selStr += "#e #n#L5##fs11# #e해외 성형#n 리스트 A#l#L6# #e해외 성형#n 리스트 B#k#l\r\n";
		if (cm.getPlayer().getAndroid() != null) {
            		
            		//selStr += "\r\n\r\n#e#r#fs12#[안드로이드 성형]#k#b#n\r\n#fs11#";
            		//selStr += "#e #n#L16# #e해외 성형#n 리스트 A#l#L17# #e해외 성형#n 리스트 B#l\r\n";
		}
         break;
         case 3:
            selStr += "\r\n#e#r[캐릭터 COLOR]#b#n\r\n";
            selStr += "#fs11##L8##e일반 염색#n하기\r\n#l";
            selStr += "#L21##e믹스 염색#n하기\r\n#l";
            selStr += "#L7##e렌즈색#n 변경하기\r\n#l";
            selStr += "#L9##e피부색#n 변경하기#l#k\r\n ";
		if (cm.getPlayer().getAndroid() != null) {
            		
            		//selStr += "\r\n\r\n#e#r[안드로이드 COLOR]#b#n\r\n";
            		//selStr += "#L19##b#e안드로이드#n#b 일반 염색#n하기\r\n#l";
            		//selStr += "#L18##b#e안드로이드#n#b 렌즈색#n 변경하기\r\n#l";
            		//selStr += "#L20##b#e안드로이드#n#b 피부색#n 변경하기#l#b\r\n";
		}
         break;
         case 4:
            selStr += "\r\n\r\n\r\n#e#r[성전환, 캐시상점]#b#n\r\n";
            selStr += "#L10##e"+gColor+"#n으로 성전환하기#l#b\r\n";
            selStr += "#L22##eSHOP#l\r\n";
         break;
      }
      cm.sendSimpleS(selStr, 4, 1052208);
   }
	else if(status == 2)
	{
		SEL_00 = selection;
		Gender = cm.getPlayer().getGender();

		if(SEL_00 == 11)
		{
			cm.dispose();
			cm.openNpc(1012117);
			return;
		}

		if (SEL_00 == 21) {
			cm.dispose();
			cm.openNpc(9000161);
			return;
		}
		if (SEL_00 == 22) {
			cm.dispose();
			cm.openShop(0);
			return;
		}

		if(SEL_00 == 10)
		{
			if(cm.getPlayer().getJob() == 10112)
			{
				cm.sendOkS("제로 직업군은 성전환을 할 수 없습니다.", 4, 1012117);
				cm.dispose();
				return;
			}
			cm.sendYesNoS("#e"+gColor+"#n#k으로 성전환을 하시겠습니까? 더 이상 해당 성별에 맞는 장비를 착용할 수 없습니다.", 4, 1012117);
		}

		Beauty = SEL_00 < 2 ? "#e헤어#n를" : SEL_00 == 2 ? "#e얼굴#n을" : "#e색깔#n을"; 
		selStr = "#fn돋움##fc0xFFFFFFFF#지금의 "+Beauty+" 전혀 새로운 스타일로 바꿔 줄 수 있지. 지금 모습이 지겨워 졌다면 바꾸고 싶은 헤어를 천천히 고민해 봐";
		switch(SEL_00)
		{
			case 1: // 헤어1
			case 12: // 헤어1
			if(!Gender)
			codyList = [30380, 30550, 30580, 30600, 30690, 30720, 30740, 30750, 30780, 30890, 30900, 30920, 30960, 30970,30980, 30990, 31360, 31380, 31570, 31580,31600,31660, 31730, 31760, 31770, 31830, 31870, 31960, 31970, 31980, 32050, 32150, 32160, 32310, 32320, 32330, 32340, 32350, 32360, 32370, 32380, 32390, 32400, 32410, 32420, 32430, 32440, 32450,32460, 32470, 32480, 32490, 32500, 32520, 32530, 32540, 32550,32560, 32640, 32650, 32660, 33000,33010, 33020, 33040, 33050, 33100, 33160, 33200, 33240, 33290, 33300, 33320,33340,33420,33470, 33540, 34000, 34010];

			else
			codyList = [30380, 30550, 30580, 30600, 30690, 30720, 30740, 30750, 30780, 30890, 30900, 30920, 30960, 30970,30980, 30990, 31360, 31380, 31570, 31580,31600,31660, 31730, 31760, 31770, 31830, 31870, 31960, 31970, 31980, 32050, 32150, 32160, 32310, 32320, 32330, 32340, 32350, 32360, 32370, 32380, 32390, 32400, 32410, 32420, 32430, 32440, 32450,32460, 32470, 32480, 32490, 32500, 32520, 32530, 32540, 32550,32560, 32640, 32650, 32660, 33000,33010, 33020, 33040, 33050, 33100, 33160, 33200, 33240, 33290, 33300, 33320,33340,33420,33470, 33540, 34000, 34010];
			break;

			case 2: // 헤어2
			case 13: // 헤어2
			if(!Gender)
			codyList = [34020, 34030, 34050, 34060, 34200, 34280, 34290, 34300, 34350, 34390, 34580, 34650, 34890, 34980, 35110, 35120,35130, 35140, 35160, 35170, 35220, 35240, 35270, 35340, 35450, 35580, 35590, 35670, 35740, 35760, 35770, 35820, 35830, 36000, 36060, 36110, 36260, 36270, 36490, 36500, 36600, 36610, 36880, 36930, 37050, 37150, 37160, 37170, 37200, 37270, 37290, 37420, 37440, 37470,37590, 37600, 37900, 37930, 38080, 38140];

			else
			codyList = [34020, 34030, 34050, 34060, 34200, 34280, 34290, 34300, 34350, 34390, 34580, 34650, 34890, 34980, 35110, 35120,35130, 35140, 35160, 35170, 35220, 35240, 35270, 35340, 35450, 35580, 35590, 35670, 35740, 35760, 35770, 35820, 35830, 36000, 36060, 36110, 36260, 36270, 36490, 36500, 36600, 36610, 36880, 36930, 37050, 37150, 37160, 37170, 37200, 37270, 37290, 37420, 37440, 37470,37590, 37600, 37900, 37930, 38080, 38140];
			break;

			case 3: // 헤어3
			case 14: // 헤어2
			if(!Gender)
			codyList = [41420, 41460, 41580, 41610, 41620, 41630, 41640, 41650, 41660, 41680, 41690, 41710, 41760, 41770, 41780, 41790, 41800, 41810, 41820, 41830, 41840, 41910, 41960, 41970, 41980, 41990, 42060, 42070, 42080, 42090, 42100, 42110,  42120, 43000, 43010, 43120, 43130, 43190, 43200, 43220, 43230, 43240, 43260, 43270, 43340, 43410, 43420, 43340, 43450, 43590, 43600, 43670, 43730, 43740, 43800, 43830, 43840, 43850, 43860, 43870, 43880, 43890, 44000, 44020, 44030, 44040, 44050, 44060, 44070, 44080, 44090, 44100, 44110, 44180, 44190, 44300, 44310, 44370, 44380, 44400, 44410, 44420, 44430, 44440, 44450, 44450, 44510, 44520, 44590, 44610, 44620, 44630, 44640, 44810, 44820, 44910, 44980, 45080, 45100, 45110, 45120, 45130, 47050, 47060, 47100, 47110, 47120, 47130, 47140, 47150, 47160, 47170, 47290, 47300, 47380, 47400, 47410, 47420, 47430, 47450,47460, 46000, 46010, 48000, 48010, 32720, 32730, 32740, 32750, 32760, 42150, 42160, 46170, 46180, 46190, 46200, 46210, 46230, 46240, 46360, 46370, 46380, 46390, 46400];

			else
			codyList = [41420, 41460, 41580, 41610, 41620, 41630, 41640, 41650, 41660, 41680, 41690, 41710, 41760, 41770, 41780, 41790, 41800, 41810, 41820, 41830, 41840, 41910, 41960, 41970, 41980, 41990, 42060, 42070, 42080, 42090, 42100, 42110,  42120, 43000, 43010, 43120, 43130, 43190, 43200, 43220, 43230, 43240, 43260, 43270, 43340, 43410, 43420, 43340, 43450, 43590, 43600, 43670, 43730, 43740, 43800, 43830, 43840, 43850, 43860, 43870, 43880, 43890, 44000, 44020, 44030, 44040, 44050, 44060, 44070, 44080, 44090, 44100, 44110, 44180, 44190, 44300, 44310, 44370, 44380, 44400, 44410, 44420, 44430, 44440, 44450, 44450, 44510, 44520, 44590, 44610, 44620, 44630, 44640, 44810, 44820, 44910, 44980, 45080, 45100, 45110, 45120, 45130, 47050, 47060, 47100, 47110, 47120, 47130, 47140, 47150, 47160, 47170, 47290, 47300, 47380, 47400, 47410, 47420, 47430, 47450,47460, 46000];
			break;

			case 4: // 헤어4
			case 15: // 헤어2
			if(!Gender)
			codyList = [46480, 46490, 46500, 46510, 46520, 46560, 46570, 46610, 46620, 46630, 46640, 48150, 48160, 48170, 48180, 48190, 48200, 48220, 48230, 48390, 48400, 48440, 48450, 48460, 48470, 48590, 48600, 48610, 48620, 48630, 48700, 48710, 48760, 48770, 48790, 48800];

			else
			codyList = [46010, 48000, 48010, 32720, 32730, 32740, 32750, 32760, 42150, 42160, 46170, 46180, 46190, 46200, 46210, 46230, 46240, 46360, 46370, 46380, 46390, 46400, 46480, 46490, 46500, 46510, 46520, 46560, 46570, 46610, 46620, 46630, 46640, 48150, 48160, 48170, 48180, 48190, 48200, 48220, 48230, 48390, 48400, 48440, 48450, 48460, 48470, 48590, 48600, 48610, 48620, 48630, 48700, 48710, 48760, 48770, 48790, 48800];
			break;


			case 5: // 얼굴1
			case 16: // 헤어2
			if(!Gender)
		       codyList = [20023, 20026, 20033, 20035, 20038, 20054, 20073, 20078, 20091, 20092, 21022, 21025, 21034, 21037,21051, 21068, 21076,21087,21088, 21099, 23004, 23007, 23009, 23013, 23014, 23030, 23055, 23059, 23065, 23066, 23070, 23076, 23094, 24005, 24006, 24009, 24010, 24025, 24032, 24052, 24053, 24057, 24063, 24064, 24065, 24069, 24090, 25001, 25003, 25009, 25010, 25012, 25013, 25018, 25019, 25028, 25030, 25031, 25032, 25034];

			else
			codyList = [20023, 20026, 20033, 20035, 20038, 20054, 20073, 20078, 20091, 20092, 21022, 21025, 21034, 21037,21051, 21068, 21076,21087,21088, 21099, 23004, 23007, 23009, 23013, 23014, 23030, 23055, 23059, 23065, 23066, 23070, 23076, 23094, 24005, 24006, 24009, 24010, 24025, 24032, 24052, 24053, 24057, 24063, 24064, 24065, 24069, 24090, 25001, 25003, 25009, 25010, 25012, 25013, 25018, 25019, 25028, 25030, 25031, 25032, 25034];
			break;

			case 6: // 얼굴2
			case 17: // 헤어2
			if(!Gender)
			codyList = [25035, 25036, 25037, 25038, 25039, 25040, 25041, 25042, 25054, 25056, 25070, 25074, 25090, 25096, 25097, 26000, 26001, 26002, 26006, 26007, 26010, 26011, 26012, 26013,26015, 26016, 26018, 26019, 26020, 26021, 26024, 26033, 26035, 26036, 26037, 26038, 26039, 26040, 26041, 26042, 26043, 26044, 26045, 26052, 26060, 26065, 26073, 26074, 26077, 26078, 26080, 26081, 26090, 28000, 28001, 28022, 27046, 27047, 27048, 27049, 27050, 27051, 27053, 27054, 27055, 27068, 27071, 27072, 27075, 27088, 27089, 27090, 27095, 27097, 27099, 28051, 28052, 28053, 28054, 28055, 28058, 28059, 28060, 28074, 28080, 28081, 28084, 28098];

			else
			codyList = [25035, 25036, 25037, 25038, 25039, 25040, 25041, 25042, 25054, 25056, 25070, 25074, 25090, 25096, 25097, 26000, 26001, 26002, 26006, 26007, 26010, 26011, 26012, 26013,26015, 26016, 26018, 26019, 26020, 26021, 26024, 26033, 26035, 26036, 26037, 26038, 26039, 26040, 26041, 26042, 26043, 26044, 26045, 26052, 26060, 26065, 26073, 26074, 26077, 26078, 26080, 26081, 26090, 28000, 28001, 28022, 27046, 27047, 27048, 27049, 27050, 27051, 27053, 27054, 27055, 27068, 27071, 27072, 27075, 27088, 27089, 27090, 27095, 27097, 27099, 28051, 28052, 28053, 28054, 28055, 28058, 28059, 28060, 28074, 28080, 28081, 28084, 28098];
			break;


			case 7:
			case 18: // 헤어2
			for(i = 0; i < 8; i++)
			codyList.push(Math.floor((SEL_00 >= 12 ? cm.getPlayer().getAndroid().getFace() : cm.isAngelicBuster() ? cm.getPlayer().getDressup() ? cm.getPlayer().getSecondFace() : cm.getPlayer().getFace() : cm.getPlayer().getFace()) / 1000) * 1000 + ((SEL_00 >= 12 ? cm.getPlayer().getAndroid().getFace() : cm.isAngelicBuster() ? cm.getPlayer().getDressup() ? cm.getPlayer().getSecondFace() : cm.getPlayer().getFace() : cm.getPlayer().getFace()) % 100) + i * 100);
			break;

			case 8:
			case 19: // 헤어2
			for(i = 0; i < 8; i++)
			codyList.push(Math.floor((SEL_00 >= 12 ? cm.getPlayer().getAndroid().getHair() : cm.isAngelicBuster() ? cm.getPlayer().getDressup() ? cm.getPlayer().getSecondHair() : cm.getPlayer().getHair() : cm.getPlayer().getHair()) / 10) * 10 + i);
			break;

			case 9:
			case 20: // 헤어2
			codyList = [0, 1, 2, 3, 4, 9, 10, 11, 12, 13, 15, 16];
			break;

			default:
			break;
		}

		if(SEL_00 < 10)
		cm.sendStyle(selStr, codyList);
		else if (SEL_00 >= 12) {
			cm.askAvatarAndroid(selStr, codyList);
		}
	}

	else if(status == 3)
	{
		if(SEL_00 == 10)
		{
			if(!Gender)
			{
				cm.getPlayer().setHair(31002);
				cm.getPlayer().setFace(21700);
				cm.getPlayer().setGender(1);
			}
			else
			{
				cm.getPlayer().setHair(30000);
				cm.getPlayer().setFace(20100);
				cm.getPlayer().setGender(0);
			}
			cm.dispose();
			cm.fakeRelog();
			cm.updateChar();
			return;
		}
		newItem = selection & 0xFF;
		if (SEL_00 >= 12) {
			switch(SEL_00)
			{
				case 12:
				case 13:
				case 14:
				case 15:
				case 19:
					cm.setHairAndroid(codyList[newItem]);
					break;
				
				case 16:
				case 17:
				case 18:
					cm.setFaceAndroid(codyList[newItem]);
					break;
				
				case 20:
					cm.setSkinAndroid(codyList[newItem]);
					break;
				
			}
			cm.dispose();
			return;
		}
		if (cm.isAngelicBuster()) {
				cm.sendNext("#fs11#어떤 모습을 스타일링 하시겠어요?\r\n\r\n#b#L1#변신전의 모습을 바꾼다#l\r\n#L2#변신후의 모습을 바꾼다#l#k");
		} else {
			if(cm.isZero() && Gender)
			{
				switch(SEL_00)
				{
					case 8:
					cm.getPlayer().setSecondBaseColor(-1);
					cm.getPlayer().setSecondAddColor(0);
					cm.getPlayer().setSecondBaseProb(0);
					case 1:
					case 2:
					case 3:
					case 4:
					cm.setZeroSecondHair(codyList[newItem]);
					break;

					case 5:
					case 6:
					case 7:
					cm.setZeroSecondFace(codyList[newItem]);
					break;

					case 9:
					cm.setZeroSecondSkin(codyList[newItem]);
					break;
				}
			}
			else
			{
				if (SEL_00 == 8) {
					cm.getPlayer().setBaseColor(-1);
					cm.getPlayer().setAddColor(0);
					cm.getPlayer().setBaseProb(0);
				}
				if (seld <= 2) {
					if (!cm.haveItem(coupon, qty)) {
						cm.sendOk("쿠폰이 없네요");
						cm.dispose();
						return;
						}
					cm.gainItem(coupon, -qty);
				}
				cm.setAvatar(4000000, codyList[newItem]);
			}
			cm.dispose();
			cm.updateChar();
		}
	} else if (status == 4) {
		if (selection == 1) {
			cm.setAvatar(4000000, codyList[newItem]);
		} else if (selection == 2) {
			switch(SEL_00)
			{
				case 8:
				cm.getPlayer().setSecondBaseColor(-1);
				cm.getPlayer().setSecondAddColor(0);
				cm.getPlayer().setSecondBaseProb(0);
				case 1:
				case 2:
				case 3:
				case 4:
				if (seld <= 2) {
					if (!cm.haveItem(coupon, qty)) {
						cm.sendOk("쿠폰이 없네요");
						cm.dispose();
						return;
						}
					cm.gainItem(coupon, -qty);
				}
				cm.setAngelicSecondHair(codyList[newItem]);
				break;

				case 5:
				case 6:
				case 7:
				if (seld <= 2) {
					if (!cm.haveItem(coupon, qty)) {
						cm.sendOk("쿠폰이 없네요");
						cm.dispose();
						return;
						}
					cm.gainItem(coupon, -qty);
				}
				cm.setAngelicSecondFace(codyList[newItem]);
				break;

				case 9:
				if (seld <= 2) {
					if (!cm.haveItem(coupon, qty)) {
						cm.sendOk("쿠폰이 없네요");
						cm.dispose();
						return;
						}
					cm.gainItem(coupon, -qty);
				}
				cm.setAngelicSecondSkin(codyList[newItem]);
				break;
			}
		}
		cm.dispose();
		cm.updateChar();
	}
}